
## Plan Result (account-delete-monitor-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97287)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.eventtracker_lambda_2D56166D


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.eventtracker_lambda_2D56166D will be updated in-place
  ~ resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Prod-EventTracker-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:486" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:486/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
      ~ version                        = "486" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"              = (sensitive value) -> null
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + eventtracker_lambda-code-deploy_lambda_codedeploy_app_2EEE3C63   = "AccountDeleteMonitor-Prod-EventTracker-Lambda"
  + eventtracker_lambda-code-deploy_lambda_codedeploy_group_40A1C4DE = "AccountDeleteMonitor-Prod-EventTracker-Lambda"
  + eventtracker_lambda_lambda_arn_F8C20C18                          = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function"
  + eventtracker_lambda_lambda_function_name_9A6276E1                = "AccountDeleteMonitor-Prod-EventTracker-Function"
  + eventtracker_lambda_lambda_version_arn_23ED45AF                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:DEPLOYED"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"00197cc4-d95d-4d52-9edd-156bfc14ceb8","JobName":"account-delete-monitor_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"account-delete-monitor-cdk","Vars":{}} -->